* deps.edn

I need to brush up on what goes in here. [[https://clojure-doc.org/articles/tutorials/getting_started/][Clojure Guides]] is probably a good help to get started with.

#+begin_src clojure :results output :tangle deps.edn
    {:paths ["src"]
     :deps {org.clojure/clojure {:mvn/version "1.12.0"}
            http-kit/http-kit {:mvn/version "2.9.0-beta2"}}
     }
#+end_src

#+RESULTS:
: class clojure.lang.Compiler$CompilerException

* core.clj

This is just to get a hello world up and running.

This is the basic code to get an image from a URL.

We want to do this to get an image from S3.

#+begin_src clojure :results output :tangle src/org/yulqen/proxypox/core.clj
  (ns org.yulqen.proxypox.core)

  (require '[org.httpkit.client :as hclient])

  (import '[javax.imageio ImageIO])
  (import '[java.io ByteArrayInputStream])
  (import '[java.awt Graphics2D AlphaComposite])
  (import '[java.io File])

  (defn read-image-using-httpkit [url]
    (let [response @(hclient/get url {:as :byte-array})]
      (if-let [err (:error response)]
        (println "HTTP request failed:" err) ; Or throw an exception
        (if (= 200 (:status response))
          (let [image-data (:body response)]
            (ImageIO/read (ByteArrayInputStream. image-data)))
          (println "Request returned non-200 status:" (:status response))))))


  (defn read-image-from-url [url]
    (try
      (let [response (client/get url {:as :byte-array})
            image-data (:body response)]
        (ImageIO/read (ByteArrayInputStream. image-data)))
      (catch Exception e
        (println "Error reading image: " (.getMessage e))
        nil)))

  (defn -main []
    (println "Hello,world!"))

  (defn report-image-size [img-url]
    (let [image (read-image-from-url img-url)]
      (if image
        (println "Successfully read image with dimensions:"
                 (.getWidth image) "x" (.getHeight image)))))


  (defn apply-watermark [base-image watermark-image x y]
    "Applies a watermark-image onto the base-image at coordinates (x, y)."
    (let [g2d (.createGraphics base-image)
          watermark-width (.getWidth watermark-image)
          watermark-height (.getHeight watermark-image)]
      (.setComposite g2d (AlphaComposite/getInstance AlphaComposite/SRC_OVER (float 0.5)))
      (.drawImage g2d watermark-image x y nil)
      (.dispose g2d)
      base-image))

  (defn save-image [image filename]
    (ImageIO/write image "png" (File. filename)))

  (defn wm-image [base watermark]
    (let [base-image (read-image-from-url base)
          watermark-image (read-image-from-url watermark)
          watermarked-image (apply-watermark base-image watermark-image 0 0)]
      (save-image watermarked-image "/tmp/WATERMARKED_IMAGE.png")
      (println "Image with watermark saved!")))
#+end_src

#+RESULTS:
: class java.io.FileNotFoundException

